# 计算 1 到 10 偶数的平方求和
alist = []
for i in range(1, 11):
    if i % 2 == 0:
        alist.append(i * i)
print(alist)  # [4, 16, 36, 64, 100]

# 列表推导式
blist = [i * i for i in range(1, 11) if i % 2 == 0]
print(blist)  # [4, 16, 36, 64, 100]

# 字典推导式
zodiac_name = ['摩羯座', '水瓶座', '双鱼座', '白羊座', '金牛座', '双子座', '巨蟹座', '狮子座', '处女座', '天秤座', '天蝎座', '射手座']
zdict = {i: 0 for i in zodiac_name}
print(
    zdict)  # {'摩羯座': 0, '水瓶座': 0, '双鱼座': 0, '白羊座': 0, '金牛座': 0, '双子座': 0, '巨蟹座': 0, '狮子座': 0, '处女座': 0,
# '天秤座': 0, '天蝎座': 0, '射手座': 0}
